In [32]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [33]:
df_cities = pd.read_csv(r"C:\Coding\assignments\transit_of_the_world_exploration\data\cities.csv")
df_lines = pd.read_csv(r"C:\Coding\assignments\transit_of_the_world_exploration\data\lines.csv")
df_station_lines = pd.read_csv(r"C:\Coding\assignments\transit_of_the_world_exploration\data\station_lines.csv")
df_stations = pd.read_csv(r"C:\Coding\assignments\transit_of_the_world_exploration\data\stations.csv")
df_systems = pd.read_csv(r"C:\Coding\assignments\transit_of_the_world_exploration\data\systems.csv")
df_track_lines = pd.read_csv(r"C:\Coding\assignments\transit_of_the_world_exploration\data\track_lines.csv")
df_tracks = pd.read_csv(r"C:\Coding\assignments\transit_of_the_world_exploration\data\tracks.csv")

In [34]:
# df_cities.info()
# df_cities.sample(10)
df_cities = df_cities.drop(["country_state"], axis=1)
df_cities

,id,name,coords,start_year,url_name,country
0,5,Aberdeen,POINT(-2.15 57.15),2017.0,aberdeen,Scotland
1,6,Adelaide,POINT(138.6 -34.91666667),2017.0,adelaide,Australia
2,7,Algiers,POINT(3 36.83333333),2017.0,algiers,Algeria
3,9,Ankara,POINT(32.91666667 39.91666667),2017.0,ankara,Turkey
4,16,Belém,POINT(-48.48333333 -1.466666667),2017.0,belem,Brazil
...,...,...,...,...,...,...
329,265,Nantes,POINT(-1.553889 47.217222),1877.0,nantes,France
330,110,Stockholm,POINT(18.05 59.28333333),1919.0,stockholm,Sweden
331,266,Rennes,POINT(-1.680833 48.114167),1897.0,rennes,France
332,15,Beijing,POINT(116.4166667 39.91666667),1965.0,beijing,China
333,69,London,POINT(-0.08333333333 51.53333333),1833.0,london,England

In [39]:
df_lines.info()
df_lines.sample(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1343 entries, 0 to 1342
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 1343 non-null   int64
 1   city_id            1343 non-null   int64
 2   name               1343 non-null   object
 3   url_name           1343 non-null   object
 4   color              1343 non-null   object
 5   system_id          1343 non-null   int64
 6   transport_mode_id  926 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 73.6+ KB

,id,city_id,name,url_name,color,system_id,transport_mode_id
691,823,114,Kasaibashi Line,823-kasaibashi-line,#5f0101,325,5.0
1060,1111,1,La Matanza,1111-la-matanza,#f3d379,416,6.0
124,118,69,Waterloo & City Line,118-waterloo-&-city-line,#50e3c2,259,4.0
1176,1270,318,1,1270-1,#ff2e17,491,5.0
987,455,114,Utsunomiya Line,455-utsunomiya-line,#f68b1e,305,4.0
428,532,114,Hachiko Line,532-hachiko-line,#a9a9a9,305,4.0
112,54,78,Línea 8,54-linea-8,#00923f,248,4.0
387,467,67,Cais do Sodré,467-cais-do-sodre,#41026c,317,NaN
1257,1353,124,Monjas,1353-monjas,#4a90e2,493,7.0
1251,1347,124,El Peral,1347-el-peral,#4a90e2,493,7.0

In [36]:
df_station_lines = df_station_lines.drop(["updated_at", "id"], axis=1)
df_station_lines

       station_id  line_id  city_id                  created_at
0            7754      570       74         2017-11-21 00:00:00
1            7771      571       74         2017-11-21 00:00:00
2            7764      571       74         2017-11-21 00:00:00
3            7763      571       74         2017-11-21 00:00:00
4            7729      571       74         2017-11-21 00:00:00
...           ...      ...      ...                         ...
16237       16554     1454       91  2019-03-11 21:35:50.069711
16238       16555     1454       91  2019-03-11 21:36:13.073166
16239       16556     1454       91  2019-03-11 21:40:42.812162
16240       16557     1454       91  2019-03-11 21:42:15.280984
16241       16558     1454       91  2019-03-11 21:42:48.700022

[16242 rows x 4 columns]

In [23]:
df_stations.info()
df_stations.sample(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15794 entries, 0 to 15793
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          15794 non-null  int64
 1   name        14248 non-null  object
 2   geometry    15794 non-null  object
 3   buildstart  14342 non-null  float64
 4   opening     15721 non-null  float64
 5   closure     15713 non-null  float64
 6   city_id     15794 non-null  int64
dtypes: float64(3), int64(2), object(2)
memory usage: 863.9+ KB

,id,name,geometry,buildstart,opening,closure,city_id
15046,15670,Yamato-Yagi,POINT(135.791451592032 34.5128898203771),1923.0,1923.0,999999.0,91
3340,201,Matta\n\n,POINT(-70.6427103892046 -33.4582372913006),2012.0,2019.0,999999.0,4
7851,5527,Tamagawa,POINT(139.668659262881 35.5896044051263),1926.0,1926.0,999999.0,114
7657,4875,Malakoff - Plateau de Vanves,POINT(2.29848780414972 48.8225170166949),NaN,1976.0,999999.0,95
11135,11404,Milano Bruzzano,POINT(9.17263087651841 45.5322034255288),2014.0,2014.0,999999.0,79
5918,5636,Daijingushita,POINT(139.99126481888 35.6942622623265),1921.0,1921.0,999999.0,114
3378,318,Antón Martín\n\n,POINT(-3.69926329749427 40.4123081507771),1919.0,1921.0,999999.0,71
13187,13508,Paiporta,POINT(-0.4182573 39.4322123),0.0,0.0,999999.0,256
2692,9019,North York Centre,POINT(-79.4129163292704 43.7689095749012),1987.0,1987.0,999999.0,247
2207,7445,Bourgeonnière,POINT(-1.5597979 47.2532522),NaN,1994.0,999999.0,265

In [30]:
# df_systems.info()
# df_systems.sample(10)

In [ ]:
df_track_lines.info()
df_track_lines.sample(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9757 entries, 0 to 9756
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          9757 non-null   int64
 1   section_id  9757 non-null   int64
 2   line_id     9757 non-null   int64
 3   created_at  9757 non-null   object
 4   updated_at  9757 non-null   object
 5   city_id     9757 non-null   int64
dtypes: int64(4), object(2)
memory usage: 457.5+ KB

,id,section_id,line_id,created_at,updated_at,city_id
9459,10402,10261,1601,2019-02-21 21:41:57.597704,2019-02-21 21:41:57.597704,48
9065,10004,9556,1588,2019-02-16 19:25:57.508376,2019-02-16 19:25:57.508376,48
6512,3031,1661,440,2017-11-21 00:00:00,2017-11-21 00:00:00,114
1369,5870,5931,997,2018-03-04 17:32:39.155377,2018-03-04 17:32:39.155377,328
9017,9909,9495,1550,2019-02-14 20:38:48.117744,2019-02-14 20:38:48.117744,236
3814,837,2881,612,2017-11-21 00:00:00,2017-11-21 00:00:00,23
6955,3499,3740,637,2017-11-21 00:00:00,2017-11-21 00:00:00,114
3260,275,1974,548,2017-11-21 00:00:00,2017-11-21 00:00:00,147
7402,3952,4327,765,2017-11-21 00:00:00,2017-11-21 00:00:00,189
2978,2947,3451,570,2017-11-21 00:00:00,2017-11-21 00:00:00,74

In [ ]:
df_tracks.info()
df_tracks.sample(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9271 entries, 0 to 9270
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          9271 non-null   int64
 1   geometry    9271 non-null   object
 2   buildstart  7663 non-null   float64
 3   opening     9250 non-null   float64
 4   closure     9240 non-null   float64
 5   length      9271 non-null   int64
 6   city_id     9271 non-null   int64
dtypes: float64(3), int64(3), object(1)
memory usage: 507.1+ KB

,id,geometry,buildstart,opening,closure,length,city_id
7749,7062,"LINESTRING(-1.3737829 47.709313,-1.3736914 47....",NaN,2014.0,999999.0,34,265
8754,9083,"LINESTRING(-71.604380326477 -33.0469569984517,...",1952.0,1952.0,1982.0,38,124
7315,10094,"LINESTRING(-4.4047006 55.9007891,-4.4046266 55...",0.0,0.0,999999.0,101,48
3281,1782,"LINESTRING(139.622753775297 35.4663952270978,1...",1928.0,1928.0,2004.0,952,114
8349,10189,"LINESTRING(-4.1336612 55.818818,-4.1339206 55....",0.0,0.0,999999.0,16,48
2036,3251,"LINESTRING(-1.5912587 47.1785246,-1.5913922 47...",NaN,2007.0,999999.0,150,265
7735,7045,"LINESTRING(-1.4694473 47.6161394,-1.4691198 47...",NaN,2014.0,999999.0,33,265
8156,7455,"LINESTRING(1.4113643 43.6008706,1.4113429 43.6...",0.0,0.0,999999.0,687,325
7514,6828,"LINESTRING(7.3384722 47.7496977,7.3378473 47.7...",2003.0,2006.0,999999.0,1124,317
8038,7291,"LINESTRING(3.87698 43.5962571,3.8772538 43.596...",0.0,0.0,999999.0,27,300